îº§ gdb a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) b main
Breakpoint 1 at 0x87d: file p2final.c, line 41.
(gdb) r
Starting program: /home/runner/Test3Session2/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:41
41    f1=input_fraction();
(gdb) s
input_fraction () at p2final.c:7
7   {
(gdb) n
9     printf("Enter the Numerator: ");
(gdb) n
10    scanf("%d",&f.num);
(gdb) n
Enter the Numerator: 1
11    printf("Enter the Denominator: ");
(gdb) n
12    scanf("%d",&f.den);
(gdb) 
Enter the Denominator: 4
13    return f;
(gdb) 
14  }
(gdb) 
main () at p2final.c:42
42    f2=input_fraction();
(gdb) 
Enter the Numerator: 
3
Enter the Denominator: 4
43    f3=input_fraction();
(gdb) 
Enter the Numerator: 1
Enter the Denominator: 2
44    largest=Largest_fraction(f1,f2,f3);
(gdb) 
45    output(f1,f2,f3,largest);
(gdb) 
46    return 0;
(gdb) 
47  }
(gdb) c
Continuing.
Largest of 1/4 , 3/4 and 1/2 is 1/4 [Inferior 1 (process 62) exited normally]
(gdb) 
